
{
  "description": "Joins a kubernetes cluster",
  "input_method": "stdin",
  "parameters": {
    "api_versions": {
      "description": "List the API versions that are available.",
      "type": "Optional[String[1]]"
    },
    "apply": {
      "description": "Apply a configuration change to a resource from a file or stdin.",
      "type": "Optional[String[1]]"
    },
    "discovery-token": {
      "description": "The discovery token is used along with the address of the API server (as an unnamed argument) to download and verify information about the cluster. The most critical part of the cluster information is the root CA bundle used to verify the identity of the server during subsequent TLS connections.",
      "type": "Optional[String[1]]"
    },
    "discovery-token-ca-cert-hash": {
      "description": "The CA key hash is used to verify the full root CA certificate discovered during token-based bootstrapping. It has the format sha256:<hex_encoded_hash>. By default, the hash value is returned in the kubernetes join command printed at the end of kubernetes init. It is in a standard format (see RFC7469) and can also be calculated by 3rd party tools or provisioning systems.",
      "type": "Optional[String[1]]"
    },
    "discovery-token-unsafe-skip-ca-verification": {
      "description": "Disable the warning/error that occurs when --discovery-token-ca-cert-hash is not provided.",
      "type": "Optional[Boolean[1]]"
    },
    "node_name": {
      "description": "Specify the Node name. The default is to use the OS hostname. This is useful on some cloud providers such as AWS. This name is also added to the node’s TLS certificate.",
      "type": "Optional[String[1]]"
    },
    "tls_bootstrap_token": {
      "description": "The token used to authenticate to the API server for the purposes of TLS bootstrapping.",
      "type": "Optional[String[1]]"
    },
    "token": {
      "description": "Often times the same token is used for both --discovery-token and --tls-bootstrap-token. This option specifies the same token for both. Other flags override this flag if present.",
      "type": "Optional[String[1]]"
    },
    "skip_preflight_checks": {
      "description": "By default, kubernetes runs a series of preflight checks to validate the system before making any changes. Advanced users can use this flag to bypass these if necessary.",
      "type": "Optional[Boolean[1]]"
    }
  }
}
